zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/component/component_tc.h
#define TC_EVCTRL_OFFSET            0x0A         /**< \brief (TC_EVCTRL offset) Event Control Register */
#define TC_EVCTRL_RESETVALUE        0x0          /**< \brief (TC_EVCTRL reset_value) Event Control Register */

#define TC_EVCTRL_EVACT_Pos         0
#define TC_EVCTRL_EVACT_Msk         (0x7u << TC_EVCTRL_EVACT_Pos) /**< \brief (TC_EVCTRL) Event Action */
#define TC_EVCTRL_EVACT(value)      ((TC_EVCTRL_EVACT_Msk & ((value) << TC_EVCTRL_EVACT_Pos)))
#define   TC_EVCTRL_EVACT_OFF       (0x0u <<  0) /**< \brief (TC_EVCTRL)  */
#define   TC_EVCTRL_EVACT_RETRIGGER (0x1u <<  0) /**< \brief (TC_EVCTRL)  */
#define   TC_EVCTRL_EVACT_COUNT     (0x2u <<  0) /**< \brief (TC_EVCTRL)  */
#define   TC_EVCTRL_EVACT_START     (0x3u <<  0) /**< \brief (TC_EVCTRL)  */
#define   TC_EVCTRL_EVACT_PPW       (0x5u <<  0) /**< \brief (TC_EVCTRL)  */
#define   TC_EVCTRL_EVACT_PWP       (0x6u <<  0) /**< \brief (TC_EVCTRL)  */
#define TC_EVCTRL_TCINV             (0x1u <<  4) /**< \brief (TC_EVCTRL) TC Event Input Polarity */
#define TC_EVCTRL_TCEI              (0x1u <<  5) /**< \brief (TC_EVCTRL) TC Event Enable */
#define TC_EVCTRL_OVFEO             (0x1u <<  8) /**< \brief (TC_EVCTRL) Event Output Enable */
#define TC_EVCTRL_MCEO_Pos          12
#define TC_EVCTRL_MCEO_Msk          (0x3u << TC_EVCTRL_MCEO_Pos) /**< \brief (TC_EVCTRL) MC Event Output Enable */
#define TC_EVCTRL_MCEO(value)       ((TC_EVCTRL_MCEO_Msk & ((value) << TC_EVCTRL_MCEO_Pos)))
#define TC_EVCTRL_MASK              0x3137u /**< \brief (TC_EVCTRL) MASK Register */

/* -------- TC_INTENCLR : (TC Offset: 0x0C) (R/W  8) Interrupt Enable Clear Register -------- */
typedef union {
  struct {
    uint8_t  OVF:1;            /*!< bit:      0  OVF Interrupt Disable              */
    uint8_t  ERR:1;            /*!< bit:      1  ERR Interrupt Disable              */
    uint8_t  _reserved0:1;     /*!< bit:      2  Reserved                           */
    uint8_t  READY:1;          /*!< bit:      3  READY Interrupt Disable            */
    uint8_t  MC:2;             /*!< bit:  4.. 5  MC Interrupt Disable               */
    uint8_t  _reserved1:2;     /*!< bit:  6.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} TC_INTENCLR_Type;

#define TC_INTENCLR_OFFSET          0x0C         /**< \brief (TC_INTENCLR offset) Interrupt Enable Clear Register */
#define TC_INTENCLR_RESETVALUE      0x0          /**< \brief (TC_INTENCLR reset_value) Interrupt Enable Clear Register */

#define TC_INTENCLR_OVF             (0x1u <<  0) /**< \brief (TC_INTENCLR) OVF Interrupt Disable */
#define TC_INTENCLR_ERR             (0x1u <<  1) /**< \brief (TC_INTENCLR) ERR Interrupt Disable */
#define TC_INTENCLR_READY           (0x1u <<  3) /**< \brief (TC_INTENCLR) READY Interrupt Disable */
#define TC_INTENCLR_MC_Pos          4
#define TC_INTENCLR_MC_Msk          (0x3u << TC_INTENCLR_MC_Pos) /**< \brief (TC_INTENCLR) MC Interrupt Disable */
#define TC_INTENCLR_MC(value)       ((TC_INTENCLR_MC_Msk & ((value) << TC_INTENCLR_MC_Pos)))
#define TC_INTENCLR_MASK            0x3Bu /**< \brief (TC_INTENCLR) MASK Register */

/* -------- TC_INTENSET : (TC Offset: 0x0D) (R/W  8) Interrupt Enable Set Register -------- */
typedef union {
  struct {
    uint8_t  OVF:1;            /*!< bit:      0  OVF Interrupt Enable               */
    uint8_t  ERR:1;            /*!< bit:      1  ERR Interrupt Enable               */
    uint8_t  _reserved0:1;     /*!< bit:      2  Reserved                           */
    uint8_t  READY:1;          /*!< bit:      3  READY Interrupt Enable             */
    uint8_t  MC:2;             /*!< bit:  4.. 5  MC Interrupt Enable                */
    uint8_t  _reserved1:2;     /*!< bit:  6.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} TC_INTENSET_Type;

#define TC_INTENSET_OFFSET          0x0D         /**< \brief (TC_INTENSET offset) Interrupt Enable Set Register */
#define TC_INTENSET_RESETVALUE      0x0          /**< \brief (TC_INTENSET reset_value) Interrupt Enable Set Register */

#define TC_INTENSET_OVF             (0x1u <<  0) /**< \brief (TC_INTENSET) OVF Interrupt Enable */
#define TC_INTENSET_ERR             (0x1u <<  1) /**< \brief (TC_INTENSET) ERR Interrupt Enable */
#define TC_INTENSET_READY           (0x1u <<  3) /**< \brief (TC_INTENSET) READY Interrupt Enable */
#define TC_INTENSET_MC_Pos          4
#define TC_INTENSET_MC_Msk          (0x3u << TC_INTENSET_MC_Pos) /**< \brief (TC_INTENSET) MC Interrupt Enable */
#define TC_INTENSET_MC(value)       ((TC_INTENSET_MC_Msk & ((value) << TC_INTENSET_MC_Pos)))
#define TC_INTENSET_MASK            0x3Bu /**< \brief (TC_INTENSET) MASK Register */

/* -------- TC_INTFLAG : (TC Offset: 0x0E) (R/W  8) Interrupt Flag Status and Clear Register -------- */
typedef union {
  struct {
    uint8_t  OVF:1;            /*!< bit:      0  OVF Interrupt Flag                 */
    uint8_t  ERR:1;            /*!< bit:      1  ERR Interrupt Flag                 */
    uint8_t  _reserved0:1;     /*!< bit:      2  Reserved                           */
    uint8_t  READY:1;          /*!< bit:      3  READY Interrupt Flag               */
    uint8_t  MC:2;             /*!< bit:  4.. 5  MC Interrupt Flag                  */
    uint8_t  _reserved1:2;     /*!< bit:  6.. 7  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} TC_INTFLAG_Type;

#define TC_INTFLAG_OFFSET           0x0E         /**< \brief (TC_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define TC_INTFLAG_RESETVALUE       0x0          /**< \brief (TC_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define TC_INTFLAG_OVF              (0x1u <<  0) /**< \brief (TC_INTFLAG) OVF Interrupt Flag */
#define TC_INTFLAG_ERR              (0x1u <<  1) /**< \brief (TC_INTFLAG) ERR Interrupt Flag */
#define TC_INTFLAG_READY            (0x1u <<  3) /**< \brief (TC_INTFLAG) READY Interrupt Flag */
#define TC_INTFLAG_MC_Pos           4
#define TC_INTFLAG_MC_Msk           (0x3u << TC_INTFLAG_MC_Pos) /**< \brief (TC_INTFLAG) MC Interrupt Flag */
#define TC_INTFLAG_MC(value)        ((TC_INTFLAG_MC_Msk & ((value) << TC_INTFLAG_MC_Pos)))
#define TC_INTFLAG_MASK             0x3Bu /**< \brief (TC_INTFLAG) MASK Register */

/* -------- TC_STATUS : (TC Offset: 0x0F) (R/   8) Status Register -------- */
typedef union {
  struct {
    uint8_t  _reserved0:3;     /*!< bit:  0.. 2  Reserved                           */
    uint8_t  STOP:1;           /*!< bit:      3  Stop Status Flag                   */
    uint8_t  SLAVE:1;          /*!< bit:      4  Slave Status Flag                  */
    uint8_t  _reserved1:2;     /*!< bit:  5.. 6  Reserved                           */
    uint8_t  SYNCBUSY:1;       /*!< bit:      7  Synchronization Busy Status        */
  } bit;                       /*!< Structure used for bit  access                  */
  uint8_t reg;                 /*!< Type      used for register access              */
} TC_STATUS_Type;

