zhengwang721/ASF/sam0/utils/cmsis/sam0d/include/component/component_tc.h
#define TC_STATUS_OFFSET            0x0F         /**< \brief (TC_STATUS offset) Status Register */
#define TC_STATUS_RESETVALUE        0x8          /**< \brief (TC_STATUS reset_value) Status Register */

#define TC_STATUS_STOP              (0x1u <<  3) /**< \brief (TC_STATUS) Stop Status Flag */
#define TC_STATUS_SLAVE             (0x1u <<  4) /**< \brief (TC_STATUS) Slave Status Flag */
#define TC_STATUS_SYNCBUSY          (0x1u <<  7) /**< \brief (TC_STATUS) Synchronization Busy Status */
#define TC_STATUS_MASK              0x98u /**< \brief (TC_STATUS) MASK Register */

/* -------- TC_COUNT16_COUNT : (TC Offset: 0x10) (R/W 16) COUNT16 Count Register -------- */
typedef union {
  uint16_t reg;                /*!< Type      used for register access              */
} TC_COUNT16_COUNT_Type;

#define TC_COUNT16_COUNT_OFFSET     0x10         /**< \brief (TC_COUNT16_COUNT offset) Count Register */
#define TC_COUNT16_COUNT_RESETVALUE 0x0          /**< \brief (TC_COUNT16_COUNT reset_value) Count Register */
#define TC_COUNT16_COUNT_MASK       0xFFFFu      /**< \brief (TC_COUNT16_COUNT) MASK Register */

/* -------- TC_COUNT32_COUNT : (TC Offset: 0x10) (R/W 32) COUNT32 Count Register -------- */
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} TC_COUNT32_COUNT_Type;

#define TC_COUNT32_COUNT_OFFSET     0x10         /**< \brief (TC_COUNT32_COUNT offset) Count Register */
#define TC_COUNT32_COUNT_RESETVALUE 0x0          /**< \brief (TC_COUNT32_COUNT reset_value) Count Register */
#define TC_COUNT32_COUNT_MASK       0xFFFFFFFFu  /**< \brief (TC_COUNT32_COUNT) MASK Register */

/* -------- TC_COUNT8_COUNT : (TC Offset: 0x10) (R/W  8) COUNT8 Count Register -------- */
typedef union {
  uint8_t reg;                 /*!< Type      used for register access              */
} TC_COUNT8_COUNT_Type;

#define TC_COUNT8_COUNT_OFFSET      0x10         /**< \brief (TC_COUNT8_COUNT offset) Count Register */
#define TC_COUNT8_COUNT_RESETVALUE  0x0          /**< \brief (TC_COUNT8_COUNT reset_value) Count Register */
#define TC_COUNT8_COUNT_MASK        0xFFu        /**< \brief (TC_COUNT8_COUNT) MASK Register */

/* -------- TC_COUNT8_PER : (TC Offset: 0x14) (R/W  8) COUNT8 Period Register -------- */
typedef union {
  uint8_t reg;                 /*!< Type      used for register access              */
} TC_COUNT8_PER_Type;

#define TC_COUNT8_PER_OFFSET        0x14         /**< \brief (TC_COUNT8_PER offset) Period Register */
#define TC_COUNT8_PER_RESETVALUE    0x0          /**< \brief (TC_COUNT8_PER reset_value) Period Register */
#define TC_COUNT8_PER_MASK          0xFFu        /**< \brief (TC_COUNT8_PER) MASK Register */

/* -------- TC_COUNT16_CC : (TC Offset: 0x18) (R/W 16) COUNT16 Compare and Capture Register -------- */
typedef union {
  uint16_t reg;                /*!< Type      used for register access              */
} TC_COUNT16_CC_Type;

#define TC_COUNT16_CC_OFFSET        0x18         /**< \brief (TC_COUNT16_CC offset) Compare and Capture Register */
#define TC_COUNT16_CC_RESETVALUE    0x0          /**< \brief (TC_COUNT16_CC reset_value) Compare and Capture Register */
#define TC_COUNT16_CC_MASK          0xFFFFu      /**< \brief (TC_COUNT16_CC) MASK Register */

/* -------- TC_COUNT32_CC : (TC Offset: 0x18) (R/W 32) COUNT32 Compare and Capture Register -------- */
typedef union {
  uint32_t reg;                /*!< Type      used for register access              */
} TC_COUNT32_CC_Type;

#define TC_COUNT32_CC_OFFSET        0x18         /**< \brief (TC_COUNT32_CC offset) Compare and Capture Register */
#define TC_COUNT32_CC_RESETVALUE    0x0          /**< \brief (TC_COUNT32_CC reset_value) Compare and Capture Register */
#define TC_COUNT32_CC_MASK          0xFFFFFFFFu  /**< \brief (TC_COUNT32_CC) MASK Register */

/* -------- TC_COUNT8_CC : (TC Offset: 0x18) (R/W  8) COUNT8 Compare and Capture Register -------- */
typedef union {
  uint8_t reg;                 /*!< Type      used for register access              */
} TC_COUNT8_CC_Type;

#define TC_COUNT8_CC_OFFSET         0x18         /**< \brief (TC_COUNT8_CC offset) Compare and Capture Register */
#define TC_COUNT8_CC_RESETVALUE     0x0          /**< \brief (TC_COUNT8_CC reset_value) Compare and Capture Register */
#define TC_COUNT8_CC_MASK           0xFFu        /**< \brief (TC_COUNT8_CC) MASK Register */

#define TC_CC32_NUM                 2
#define TC_CC8_NUM                  2
#define TC_CC16_NUM                 2

/** \brief TC_COUNT8 hardware registers */
typedef struct { /* 8-bit Counter Mode */
  __IO TC_CTRLA_Type             CTRLA;       /**< \brief Offset: 0x00 (R/W 16) Control A Register */
  __IO TC_READREQ_Type           READREQ;     /**< \brief Offset: 0x02 (R/W 16) Read Request Register */
  __IO TC_CTRLBCLR_Type          CTRLBCLR;    /**< \brief Offset: 0x04 (R/W  8) Control B Clear Register */
  __IO TC_CTRLBSET_Type          CTRLBSET;    /**< \brief Offset: 0x05 (R/W  8) Control B Set Register */
  __IO TC_CTRLC_Type             CTRLC;       /**< \brief Offset: 0x06 (R/W  8) Control C Register */
       RoReg8                    Reserved1[0x1];
  __IO TC_DEBUG_Type             DEBUG;       /**< \brief Offset: 0x08 (R/W  8) Debug Register */
       RoReg8                    Reserved2[0x1];
  __IO TC_EVCTRL_Type            EVCTRL;      /**< \brief Offset: 0x0A (R/W 16) Event Control Register */
  __IO TC_INTENCLR_Type          INTENCLR;    /**< \brief Offset: 0x0C (R/W  8) Interrupt Enable Clear Register */
  __IO TC_INTENSET_Type          INTENSET;    /**< \brief Offset: 0x0D (R/W  8) Interrupt Enable Set Register */
  __IO TC_INTFLAG_Type           INTFLAG;     /**< \brief Offset: 0x0E (R/W  8) Interrupt Flag Status and Clear Register */
  __I  TC_STATUS_Type            STATUS;      /**< \brief Offset: 0x0F (R/   8) Status Register */
  __IO TC_COUNT8_COUNT_Type      COUNT;       /**< \brief Offset: 0x10 (R/W  8) Count Register */
       RoReg8                    Reserved3[0x3];
  __IO TC_COUNT8_PER_Type        PER;         /**< \brief Offset: 0x14 (R/W  8) Period Register */
       RoReg8                    Reserved4[0x3];
  __IO TC_COUNT8_CC_Type         CC[TC_CC8_NUM]; /**< \brief Offset: 0x18 (R/W  8) Compare and Capture Register */
       TC_COUNT8_CC_Type         Reserved5[4 - TC_CC8_NUM];
} TcCount8;

